# dz3


# Зад 1. Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих
#  на нечётной позиции. Пример: - [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12

# s = [2, 3, 5, 9, 3] 
# sum = 0
# for i in range(len(s)):
#     if i % 2 != 0:
#         sum += s[i]
#         print(s[i], end=" ")
# print()
# print(f'sum of numbers: {sum}')

# -------------------------------------------------------------------------------------------------------

# Зад 2. Напишите прогр, к-я найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй
#  и предпоследний и т.д.    Пример: [2, 3, 4, 5, 6] => [12, 15, 16];    [2, 3, 5, 6] => [12, 15]

# s = [int(i) for i in input('Input a list: ').split()]
# print(s)
# p = 1
# s2 = []

# if len(s) % 2 == 0:
#     l = int(len(s) / 2)
#     for i in range(l):
#         p = s[i] * s[len(s) - 1 - i]
#         s2.append(p)
#     print(s2)
# else:
#     l = int(len(s) / 2) + 1
#     for i in range(l):
#         p = s[i] * s[len(s) - 1 - i]
#         s2.append(p)
#     print(s2)  

# -------------------------------------------------------------------------------------------------------

#  Зад 3. Задайте список из вещественных чисел. Напишите прогр, к-я найдёт разницу между макс-м и мин-м значением
#  дробной части элементов. Пример:  [1.1, 1.2, 3.1, 5, 10.01] => 0.19

# s = [1.1, 1.2, 3.1, 5.1, 10.01]
# s2 = []
# for i in s:
#     s2.append(round(i % 1, 2))
# print(s2)
# print(f'number difference: {max(s2) - min(s2)}')

# ---------------------------------------------------------------------------------------------------------

# Зад 4. Напишите прогр, которая будет преобразовывать десятичное число в двоичное.
# Пример:  45 -> 101101;   3 -> 11;     2 -> 10

# n = int(input('Input n: '))
# b = ''
# while n > 0:
#     b = str(n % 2) + b
#     n = n // 2
# print(b)
# print(bin(n))                     # проверка

#-------------------------------------------------------------------------------------------------------

# Зад 5. Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.
# Пример: для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21]

# n = int(input('Input n: '))

# s = []
# a, b = 1, 1
# for i in range(n-1):
#     s.append(a)
#     a, b = b, a + b

# a, b = 0, 1
# for i in range(n):
#     s.insert(0, a)
#     a, b = b, a - b

# print(s)








